title_data_student = ['Student_id', 'Surname', 'Name', 'Year of study',
                      'Class name']
title_data_progress = ['Student_id', 'Lesson', 'Grade']

DATA_STUDENT = [['1', 'Иванов', 'Иван', '3', 'Г'],
                ['2', 'Петров', 'Петр', '3', 'А'],
                ['3', 'Сидоров', 'Сергей', '3', 'Б'],
                ['4', 'Кузнецов', 'Николай', '3', 'А'],
                ['5', 'Кругляк', 'Яна', '3', 'В'],
                ['6', 'Снижко', 'Ольга', '3', 'А'],
                ['7', 'Иванова', 'Светлана', '3', 'В'],
                ['8', 'Селиверстова', 'Иван', '3', 'Г'],
                ['9', 'Судженко', 'Игорь', '3', 'Б'],
                ['10', 'Харламова', 'Юлия', '3', 'В']]

DATA_PROGRESS = [['1', 'Математика', '5'], ['1', 'Русский язык', '5'],
                 ['1', 'Литература', '4'], ['2', 'Математика', '5'],
                 ['2', 'Русский язык', '4'], ['2', 'Литература', '4'],
                 ['3', 'Математика', '3'], ['3', 'Русский язык', '3'],
                 ['3', 'Литература', '3'], ['4', 'Математика', '4'],
                 ['4', 'Русский язык', '4'], ['4', 'Литература', '4'],
                 ['5', 'Математика', '5'], ['5', 'Русский язык', '5'],
                 ['5', 'Литература', '5'], ['6', 'Математика', '5'],
                 ['6', 'Русский язык', '3'], ['6', 'Литература', '3'],
                 ['7', 'Математика', '4'], ['7', 'Русский язык', '4'],
                 ['7', 'Литература', '3'], ['8', 'Математика', '5'],
                 ['8', 'Русский язык', '5'], ['8', 'Литература', '5'],
                 ['9', 'Математика', '3'], ['9', 'Русский язык', '5'],
                 ['9', 'Литература', '5'], ['10', 'Математика', '5'],
                 ['10', 'Русский язык', '5'], ['10', 'Литература', '5']]
